Tekla Open API Reference for Tekla Structures 2025
WpfSaveLoad.HelpFileTypeEnum Enumeration
 The help file types.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum HelpFileTypeEnum
Public Enumeration HelpFileTypeEnum
Members
Member name | Value | Description
General | 0 |  The general help file; help.chm.
UserDefined | 1 |  The user defined help file.
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace